In [5]:
import pandas as pd
import xlwings as xw

students = (
  {'TITLE': ['MR.', 'Mr.', 'Mr.', 'Miss', 'Miss', 'Mr.', 'Miss', 'Miss', 'Miss', 'Mr.'],
   'FIRST_NAME': ['ALAN', 'Daniel', 'Ben', 'Kavita', 'Linda', 'Omar', 'Jane', 'Felicia', 'Rachel',
                  'Bob'],
   'LAST_NAME': ['NISHIHARA', 'Smith', 'Leibstrom', 'Kanabar', 'Thiel', 'Reichel',
                 'OConner', 'Rao', 'Crock', 'McDonald'],
   'STATE': ['OR', 'NY', 'NY', 'PA', 'CA', 'OK', 'HI',
                  'NY','FL', 'FL'],
   'YR': [4, 1, 1, 1, 4, 2, 2, 3, 1, 1],
   'AGE': [22, 18, 19, 19, 22, 21, 19, 20, 17, 18],
   'CALC_101_FINAL': [100, 90, 80, None, 60, 70, None, None, None, 98],
   'ENG_101_FINAL': [100, 80, None, None, 40, 50, None, None, 60, 65],
   'ECON_101_FINAL': [100, 90, 80, None, None, None, None, None, None, None],
   'STAT_201_FINAL': [100, 200, 300, None, None, None, None, None, None, None]})

df_students = pd.DataFrame(students)
df_students.index = [1,2,3,4,5,6,7,8,9,10]

xw.view(df_students.head(2))

df_students.head(3)

,TITLE,FIRST_NAME,LAST_NAME,STATE,YR,AGE,CALC_101_FINAL,ENG_101_FINAL,ECON_101_FINAL,STAT_201_FINAL
1,MR.,ALAN,NISHIHARA,OR,4,22,100.0,100.0,100.0,100.0
2,Mr.,Daniel,Smith,NY,1,18,90.0,80.0,90.0,200.0
3,Mr.,Ben,Leibstrom,NY,1,19,80.0,NaN,80.0,300.0